Tekla Open API Reference for Tekla Structures 2025
ViewCamera.Select Method
Updates the camera parameters from the application view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select()
Public Function Select As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace